docs/tutorial.org
#+TITLE: Mikrokosmos
#+SUBTITLE: Programming on the λ-calculus
#+AUTHOR: Mario Román [[https://github.com/M42/][(github)]]
#+EMAIL: mromang08@gmail.com
#+SETUPFILE: html.setup

* The \lambda-calculus
** The \lambda-calculus
The [[https://en.wikipedia.org/wiki/Lambda_calculus][*λ-calculus*]] (or *lambda calculus*) is a logical formal system
which is also a model of computation (like Turing machines). It was
introduced in the 1930s by Alonzo Church, who was looking for a formal
system able to express the notion of computability. It is
Turing-complete, that is, it has the property that every computable
function can be written on λ-calculus.

Its syntax is very simple; any expression is either:

  - a *variable*, which could have appeared before on the lambda 
    abstraction;
    
  - a *lambda abstraction* $\lambda x. -$, which can be interpreted 
    as a function taking $x$ as an argument and returning what is
    written under $-$, which can depend on $x$;
    
  - or an *application* of two expressions $(\lambda x. M)N$ which 
    applies the function $(\lambda x. M)$ over the argument $N$.
    When a function is applied, all the ocurrences of $x$ on $M$ will 
    be substituted by $N$. This is what is called a *\beta-reduction*;
    it captures the notion of function application.

That is, in λ-calculus any function $f$ can be written as $(\lambda x.f(x))$, 
and it can be applied to an argument and \beta-reduced as

\[ (\lambda x.f(x))\ y \longrightarrow f(y). \]

For example, the function that duplicates an element could be written
as $(\lambda x.\ 2 \cdot x)$, and it would be applied to $3$ as

\[ (\lambda x.\ 2 \cdot x)\ 3 \longrightarrow 2 \cdot 3 \longrightarrow 6. \]

In this chapter, however, we will restrict ourselves to very basic
functions which do not involve arithmetic. How to define natural
numbers, addition or multiplication will be topics for future
chapters.

  * [[https://www.youtube.com/watch?v=eis11j_iGMs][Lambda Calculus - Computerphile]]

** A first example
In Mikrokosmos, it is possible to use the backslash character as a λ
to make the input easier. If you happen to have a greek keyboard
configured, however, feel free to write "λ"! Mikrokosmos accepts both
sintaxes. For example, the nested expression $\lambda x.(\lambda y.x)$
can be written as =\x.(\y.x)=.

Our first example defines a very simple lambda term, the 
*identity function* $\lambda x. x$; which is a function that takes an argument
$x$ and returns it unchanged. Our first statement just after this
definition will be apply this function to itself. Keep in mind during
this tutorial that it is perfectly possible to apply functions to
other functions or to themselves; in fact, this is one of the core
ideas of lambda calculus.

In the previous example, the evaluation has followed this
chain of \beta-reductions

\[ 
id\ id \longrightarrow (\lambda x.x)(\lambda x'.x') \longrightarrow (\lambda x'.x') \longrightarrow  id.
\]

Note that the specific name of a variable is irrelevant. They act only
as placeholders. A perfectly valid definition of =id= would be =id = \a.a=
or =id = \b.b=.

** Some more examples
Function application is *left distributive* and parentheses can be
ommited when they are not necessary, that is, =f g h= must be read as
=(f(g))(h)= instead of =f(g(h))=. This goes against the usual
mathematical convention, which always writes parentheses on functions,
that is, we write
\[
f\ x\quad\text{ instead of }\quad f(x);
\]

and
\[
f\ x\ y\quad\text{ instead of }\quad (f(x))(y)\ \text{ or }\  f(x,y);
\]

but this makes it less verbose to write multiple argument functions
such as the *constant* function, which takes two arguments and
returns the first one.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
const = \x.\y.x
const id id
const id const</script>
</div>
#+END_EXPORT

Note that, in λ-calculus, a "function taking two arguments" and "a
function that takes an argument and returns a function taking the
second" are conceptually the same. This equivalence is called
*[[https://en.wikipedia.org/wiki/Currying][currying]]* in honor of [[https://en.wikipedia.org/wiki/Haskell_Curry][Haskell Curry]], the logician who developed this
idea, previously discovered by Schönfinkel and Frege.

This is why we can see every function with two arguments as a function
taking only one argument and returning again a function taking the
second one. For example, the =(const id)= function is a function that
takes only one argument, discards it, and outputs =id=.

A more useful example of function taking functions as arguments is the
function **composition**, which takes two functions and returns a new
one created by applying the two sequentially. This corresponds to the
usual mathematical function composition $f \circ g$.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Comments can be inserted starting a line with the # character
# A constant function
alwaysid = const id
alwaysid id
alwaysid const

# Function composition
compose = \f.\g.\x.f (g x)
compose id id</script>
</div>
#+END_EXPORT

** An exercise
*Exercise 1.1:* Think what should be the result of evaluating the
following expressions and then check it with the interpreter.

  - =compose const id=
  - =compose id const=
  - =compose const const=

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
#+END_EXPORT

* Boolean logic
