docs/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-29 Tue 19:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mikrokosmos</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román [[https://github.com/M42/][(github)]](github)" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/codemirror/5.29.0/codemirror.css">
<link rel="stylesheet" href="styles/mikrocode.css">
</head>
<body>
<div id="content">
<h1 class="title">Mikrokosmos
<br>
<span class="subtitle">Programming on the λ-calculus</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5f13c2a">1. The &lambda;-calculus</a>
<ul>
<li><a href="#org5bb9158">1.1. The &lambda;-calculus</a></li>
<li><a href="#org5aa7bc0">1.2. A first example</a></li>
<li><a href="#org41d52eb">1.3. Some more examples</a></li>
<li><a href="#org6d6ed4d">1.4. An exercise</a></li>
</ul>
</li>
<li><a href="#org8dc0986">2. Boolean logic</a>
<ul>
<li><a href="#orgb9e1545">2.1. Booleans</a></li>
<li><a href="#org3891c36">2.2. If-else</a></li>
<li><a href="#org680e5ba">2.3. Logic gates</a></li>
<li><a href="#orgfb41ad8">2.4. Exercises and more logical gates</a></li>
</ul>
</li>
<li><a href="#org3b5bb4d">3. Numbers</a>
<ul>
<li><a href="#orgf14768a">3.1. Peano and the natural numbers</a></li>
<li><a href="#orgb717667">3.2. Addition and multiplication</a></li>
<li><a href="#orge0d82a3">3.3. The predecessor function</a></li>
<li><a href="#orgaa6a06b">3.4. Predicates on natural numbers</a></li>
</ul>
</li>
<li><a href="#orgfa8efb2">4. Combinatory logic</a>
<ul>
<li><a href="#orge80361e">4.1. SKI combinators</a></li>
<li><a href="#org5974dee">4.2. Schönfinkel combinators</a></li>
</ul>
</li>
<li><a href="#org491a8ec">5. Data structures</a>
<ul>
<li><a href="#orgd66e0e1">5.1. Pairs</a></li>
<li><a href="#orgf162806">5.2. Lists I: nil and cons</a></li>
<li><a href="#org968c870">5.3. Lists II: map and filter</a></li>
<li><a href="#org5ff6639">5.4. Binary trees</a></li>
</ul>
</li>
<li><a href="#orgac3e947">6. Recursion</a>
<ul>
<li><a href="#orgb071650">6.1. Fixpoints</a></li>
<li><a href="#orgfe49225">6.2. Evaluation</a></li>
</ul>
</li>
<li><a href="#org9e0c1d1">7. Types</a>
<ul>
<li><a href="#org5d19b13">7.1. Simply typed &lambda;-calculus</a></li>
<li><a href="#orgbf73bb5">7.2. Propositions as types</a></li>
<li><a href="#orgdd596df">7.3. Products, unions and logic</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org5f13c2a" class="outline-2">
<h2 id="org5f13c2a"><span class="section-number-2">1</span> The &lambda;-calculus</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-org5bb9158" class="outline-3">
<h3 id="org5bb9158"><span class="section-number-3">1.1</span> The &lambda;-calculus</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The <a href="https://en.wikipedia.org/wiki/Lambda_calculus"><b>λ-calculus</b></a> (or <b>lambda calculus</b>) is a logical formal system
which is also a model of computation (like Turing machines). It was
introduced in the 1930s by Alonzo Church, who was looking for a formal
system able to express the notion of computability. It is
Turing-complete, that is, it has the property that every computable
function can be written on λ-calculus.
</p>

<p>
Its syntax is very simple; any expression is either:
</p>

<ul class="org-ul">
<li>a <b>variable</b>, which could have appeared before on the lambda 
abstraction;</li>

<li>a <b>lambda abstraction</b> \(\lambda x. -\), which can be interpreted 
as a function taking \(x\) as an argument and returning what is
written under \(-\), which can depend on \(x\);</li>

<li>or an <b>application</b> of two expressions \((\lambda x. M)N\) which 
applies the function \((\lambda x. M)\) over the argument \(N\).
When a function is applied, all the ocurrences of \(x\) on \(M\) will 
be substituted by \(N\). This is what is called a <b>&beta;-reduction</b>;
it captures the notion of function application.</li>
</ul>

<p>
That is, in λ-calculus any function \(f\) can be written as \((\lambda x.f(x))\), 
and it can be applied to an argument and &beta;-reduced as
</p>

<p>
\[ (\lambda x.f(x))\ y \longrightarrow f(y). \]
</p>

<p>
For example, the function that duplicates an element could be written
as \((\lambda x.\ 2 \cdot x)\), and it would be applied to \(3\) as
</p>

<p>
\[ (\lambda x.\ 2 \cdot x)\ 3 \longrightarrow 2 \cdot 3 \longrightarrow 6. \]
</p>

<p>
In this chapter, however, we will restrict ourselves to very basic
functions which do not involve arithmetic. How to define natural
numbers, addition or multiplication will be topics for future
chapters.
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=eis11j_iGMs">Lambda Calculus - Computerphile</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5aa7bc0" class="outline-3">
<h3 id="org5aa7bc0"><span class="section-number-3">1.2</span> A first example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
In Mikrokosmos, it is possible to use the backslash character as a λ
to make the input easier. If you happen to have a greek keyboard
configured, however, feel free to write "λ"! Mikrokosmos accepts both
sintaxes. For example, the nested expression \(\lambda x.(\lambda y.x)\)
can be written as <code>\x.(\y.x)</code>.
</p>

<p>
Our first example defines a very simple lambda term, the 
<b>identity function</b> \(\lambda x. x\); which is a function that takes an argument
\(x\) and returns it unchanged. Our first statement just after this
definition will be apply this function to itself. Keep in mind during
this tutorial that it is perfectly possible to apply functions to
other functions or to themselves; in fact, this is one of the core
ideas of lambda calculus.
</p>

<p>
In the previous example, the evaluation has followed this
chain of &beta;-reductions
</p>

<p>
\[ 
id\ id \longrightarrow (\lambda x.x)(\lambda x'.x') \longrightarrow (\lambda x'.x') \longrightarrow  id.
\]
</p>

<p>
Note that the specific name of a variable is irrelevant. They act only
as placeholders. A perfectly valid definition of <code>id</code> would be <code>id = \a.a</code>
or <code>id = \b.b</code>.
</p>
</div>
</div>

<div id="outline-container-org41d52eb" class="outline-3">
<h3 id="org41d52eb"><span class="section-number-3">1.3</span> Some more examples</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Function application is <b>left distributive</b> and parentheses can be
ommited when they are not necessary, that is, <code>f g h</code> must be read as
<code>(f(g))(h)</code> instead of <code>f(g(h))</code>. This goes against the usual
mathematical convention, which always writes parentheses on functions,
that is, we write
\[
f\ x\quad\text{ instead of }\quad f(x);
\]
</p>

<p>
and
\[
f\ x\ y\quad\text{ instead of }\quad (f(x))(y)\ \text{ or }\  f(x,y);
\]
</p>

<p>
but this makes it less verbose to write multiple argument functions
such as the <b>constant</b> function, which takes two arguments and
returns the first one.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
const = \x.\y.x
const id id
const id const</script>
</div>

<p>
Note that, in λ-calculus, a "function taking two arguments" and "a
function that takes an argument and returns a function taking the
second" are conceptually the same. This equivalence is called
<b><a href="https://en.wikipedia.org/wiki/Currying">currying</a></b> in honor of <a href="https://en.wikipedia.org/wiki/Haskell_Curry">Haskell Curry</a>, the logician who developed this
idea, previously discovered by Schönfinkel and Frege.
</p>

<p>
This is why we can see every function with two arguments as a function
taking only one argument and returning again a function taking the
second one. For example, the <code>(const id)</code> function is a function that
takes only one argument, discards it, and outputs <code>id</code>.
</p>

<p>
A more useful example of function taking functions as arguments is the
function <b><b>composition</b></b>, which takes two functions and returns a new
one created by applying the two sequentially. This corresponds to the
usual mathematical function composition \(f \circ g\).
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Comments can be inserted starting a line with the # character
# A constant function
alwaysid = const id
alwaysid id
alwaysid const

# Function composition
compose = \f.\g.\x.f (g x)
compose id id</script>
</div>
</div>
</div>

<div id="outline-container-org6d6ed4d" class="outline-3">
<h3 id="org6d6ed4d"><span class="section-number-3">1.4</span> An exercise</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<b>Exercise 1.1:</b> Think what should be the result of evaluating the
following expressions and then check it with the interpreter.
</p>

<ul class="org-ul">
<li><code>compose const id</code></li>
<li><code>compose id const</code></li>
<li><code>compose const const</code></li>
</ul>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
