docs/tutorial.html
# -- Your solution goes here</script>
</div>
</div>
</div>
</div>

<div id="outline-container-org8dc0986" class="outline-2">
<h2 id="org8dc0986"><span class="section-number-2">2</span> Boolean logic</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgb9e1545" class="outline-3">
<h3 id="orgb9e1545"><span class="section-number-3">2.1</span> Booleans</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://en.wikipedia.org/wiki/Boolean_algebra">Boolean logic</a> can be encoded in &lambda;-calculus. In boolean logic, we
have two elements <code>true</code> and <code>false</code>; and some logical gates such as
</p>

<ul class="org-ul">
<li>the <b>and</b> gate, which outputs true if and only if its two inputs 
are true.</li>
<li>the <b>or</b> gate, which outputs true if any of its inputs is true,
or even if <i>both</i> are true.</li>
<li>the <b>not</b> gate, which outpus true if and only if its input is
false.</li>
</ul>

<p>
For example,
</p>

<p>
\[
\mathtt{not(\ or ( true, false )\ ) = not\ true = false}.
\]
</p>

<p>
Our intuition on what means to be a truth value is that it can
distinghish between two values (<b>true</b> or <b>false</b>) or two branches on
a program <code>(if ... else ...)</code>. We are going to use this intuition to
write an encoding of boolean values based on their ability to choose
between two branches. Maybe surprisingly, this encoding will be also
useful to write the usual boolean logic gates.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Church encoding of boolean truth values
true  = \a.\b.a
false = \a.\b.b
true
false</script>
</div>

<p>
Here, a truth value is a function on two elements that chooses one of them.
</p>

<ul class="org-ul">
<li>\(\mathtt{true}\ a\ b  = a\)</li>
<li>\(\mathtt{false}\ a\ b = b\)</li>
</ul>

<p>
This is called the <b>Church encoding</b> of the booleans, as it was
firstly used by Alonzo Church. This idea of defining a type based not
on its content but on how it can be used will appear later, when we
define more complex data structures.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
true id const
false id const
true true false
false true false</script>
</div>

<p>
In particular, <code>true</code> is exactly the same lambda term as <code>const</code>. This
is a very usual phenomenon in lambda calculus, where the same function
can be interpreted differently in different contexts. Mikrokosmos
allows us to have multiple names for the same term.
</p>
</div>
</div>

<div id="outline-container-org3891c36" class="outline-3">
<h3 id="org3891c36"><span class="section-number-3">2.2</span> If-else</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The advantage of this way of encoding the boolean values is that they
can be easily used in combination with other lambda terms. In
particular, the way to encode an if-else is almost trivial: it is
already encoded on the lambda terms!
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# If true, then the id function will be returned
# if false, then the const function will be returned 
(\b. b id const) true
(\b. b id const) false</script>
</div>

<p>
If you really want to write an <code>if-else</code> function, it will be, quite
literally, the trivial one
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
ifelse = \b.b
(ifelse true) id const
(ifelse false) id const</script>
</div>
</div>
</div>

<div id="outline-container-org680e5ba" class="outline-3">
<h3 id="org680e5ba"><span class="section-number-3">2.3</span> Logic gates</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Usual operations on booleans can be defined too on this encoding and
they will be surprisingly easy if we think of booleans as functions
choosing from two terms.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# The and gate takes two booleans and returns a true if and only if 
# the two given booleans are true. 
and = \p.\q.p q p
# Checking the truth table for the "and" gate
and true true
and true false
and false true
and false false</script>
</div>

<p>
<b>Exercise 2.1:</b> Think why this definition of the `and` gate works.
<i>Hint: think what happens when the first argument is a <code>true</code>.</i>
<i>What happens if it is a <code>false</code>?</i>
</p>

<p>
The <code>or</code> gate can be defined in a similar way.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# The or gate takes two booleans and returns a true if and only if
# any of them (or both) are true
or = \p.\q.p p q
# Checking the truth table for the "or" gate
or true true
or true false
or false true
or false false</script>
</div>

<p>
And finally, the negation operator is only a way of interchanging the two truth values
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
not = \b.b false true
# Truth table for the "not" gate
not true
not false
not (and true true)</script>
</div>
</div>
</div>

<div id="outline-container-orgfb41ad8" class="outline-3">
<h3 id="orgfb41ad8"><span class="section-number-3">2.4</span> Exercises and more logical gates</h3>
<div class="outline-text-3" id="text-2-4">
<p>
The boolean logic implication operator works also as a boolean gate, it can be defined as
</p>

<p>
\[(a \to b) \equiv (\neg a) \vee b,\]
</p>

<p>
that is, the implication is true if both are true or if the premise is false.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
implies = \a.\b.or (not a) b
implies true true
implies true false
implies false true
implies false false</script>
</div>

<p>
<b>Exercise 2.2:</b> Compute the logic table for the implication using the
 previous definition.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>

<p>
<b>Exercise 2.3:</b> Compute the following logic clauses using lambda calculus
</p>

<ul class="org-ul">
<li>True or false implies false.</li>
<li>False implies that: false implies false.</li>
<li>The negation of false and the negation of true both imply true.</li>
</ul>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>

<p>
<b>Exercise 2.4:</b> Define the `xor` gate as a lambda term. The `xor` of
two boolean values must return a true if and only if <b>exactly one</b> of
them are true. Check also its logic table.
<i>Hint: you may want to use the already defined `not`.</i>
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b5bb4d" class="outline-2">
<h2 id="org3b5bb4d"><span class="section-number-2">3</span> Numbers</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgf14768a" class="outline-3">
<h3 id="orgf14768a"><span class="section-number-3">3.1</span> Peano and the natural numbers</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In the 19th century, <a href="https://en.wikipedia.org/wiki/Peano_axioms">Giuseppe Peano</a> gave a definition of the natural
numbers and an axiomatic theory of them based on only two contructors
</p>

<ul class="org-ul">
<li>The zero is a natural number, written as Z.</li>
<li>The successor of a natural number is a natural number, written as
S.</li>
</ul>

<p>
In those terms, the usual natural numbers will be
</p>

<p>
\[ Z,\ SZ,\ S(SZ),\ S(S(SZ)),\ \dots \]
</p>

<p>
The question is now how can we encode them on &lambda;-calculus. We do
not have the ability to write the two constructors on &lambda;-calculus,
so we will make the natural numbers depend on them. This is again the
same idea we used when we tried to encode booleans, we do not care
about the content, but about how can we use them later.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition of the natural numbers
0 = \s.\z.z
succ = \n.\s.\z.s (n s z)

# Names for the first six natural numbers
succ 0
succ (succ 0)
succ (succ (succ 0))</script>
</div>

<p>
Under this interpretation, a number <code>n</code> is really a function taking a
function <code>a</code> as an argument and applying it <code>n</code> times over the
argument <code>b</code>.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
5
5 not true
4 not false</script>
</div>

<p>
<b>Exercise 3.1:</b> Define a function that takes a natural number and
returns true if and only if the number is even. 
<i>Hint: you may want to interpret the given number as a function.</i>
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
