docs/tutorial.org
** Addition and multiplication
The encoding of the addition and multiplication of natural numbers
will profit from the interpretation of numbers as functions. This is,
in fact, the only way we can use naturals; but we will quickly see
that this is an strenght instead of a weakness of our encoding. We are
really encoding naturals as their induction principle: we can define a
function by defining a zero and a successor.

The =double= function will only change the successor for the
composition of the successor function with itself.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
double = \n.\s.\z.n (compose s s) z
double 0
double 3
double 4</script>
</div>
#+END_EXPORT

*Exercise 3.2*: Define a =triple= function.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
#+END_EXPORT

We are going now to define *addition* using this same principle. It
takes a successor and a zero, computes the first number as =(n s z)=
and then uses it as a zero on the interpretation of the second one.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
plus = \m.\n.\s.\z.m s (n s z)
plus 2 1
plus 3 4
plus 0 5</script>
</div>
#+END_EXPORT

*Exercise 3.3:* How would you define multiplication? Keep in mind that
you can use a number as a function. Keep also in mind the previous
exercises on =double= and =triple=.  /Spoilers below!/

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
#+END_EXPORT

There many possible ways of defining multiplication. Some of them can
use the repeated application of =plus= to a number; but we are going
to define *multiplication* in a way that is similar to how we defined
=double= previously. We are going to interpret the successor as the
n-fold application of successor.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
mult = \m.\n.\s.\z.m (n s) z
mult 0 3
mult 1 5
mult 3 4</script>
</div>
#+END_EXPORT

** The predecessor function
But, how to compute the predecessor of a number? We have not encoded
negative numbers, so it could be a function returning zero whenever it
tries to get the predecessor of zero. It is an insightful exercise to
try to define it by yourself, but please, do not get too obsessed with
it. The solution is certainly not easy.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
#+END_EXPORT

The solution is the term that follows this paragraph. You probably
expected something easier! Kleene, who was a student of Alonzo Church,
discovered for the first time how to write a predecessor on lambda
calculus while at the dentist. This discovery made Church start
thinking that every intuitively computable function could be computed
using lambda calculus, that is, that the notions of lambda-computable
function and intuitively computable function would coincide.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
pred = \n.\f.\x.n (\g.(\h.h (g f))) (\u.x) (\u.u)
pred 4
pred 1
pred 0</script>
</div>
#+END_EXPORT

But why does something like this even work? The main idea is to create
a function that can be applied to a pair of numbers $n$ times and in
such a way that the first application renders $1,0$, and any
subsequent application acts as a successor on both numbers. We finally
take only the second one. A detailed derivation of this function can
be found [[https://en.wikipedia.org/wiki/Church_encoding#Derivation_of_predecessor_function][here]].

*Exercise 3.4:* Use the predecessor function to define the =minus=
function. It should return the difference between two numbers. It
should return zero whenever the first number is smaller than the
second.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
#+END_EXPORT

** Predicates on natural numbers
This encoding even allow us to write predicates on natural
numbers. The first predicate will be a function distinguishing a
successor from a zero. It will be user later to build more complex
ones.

It is built by appliying a =const false= function =n= times to a true
constant. Only if it is applied =0= times, it will return a true
value.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
iszero = \n.(n (const false) true)
iszero 0
iszero 2
iszero 1</script>
</div>
#+END_EXPORT

Using this predicate, we can build =eq= and =leq=, corresponding to $==$ and $\leq$.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
leq = \m.\n.(iszero (minus m n))
eq  = \m.\n.(and (leq m n) (leq n m))

leq 2 3
leq 4 1
eq  5 5</script>
</div>
#+END_EXPORT
* Combinatory logic
** SKI combinators
[[https://en.wikipedia.org/wiki/Combinatory_logic][Combinatory logic]] provides a notation for \lambda-terms independent
from quantified variables. Every \lambda-expression can be written in
terms of three combinators, $S,K,I$, which are defined as

 - $I = \lambda x.x$, the identity function.
 - $K = \lambda x.\lambda y.x$, the constant function.
 - $S = \lambda x.\lambda y.\lambda z. x z (y z)$, a generalized application.
 
The first one, the identity, can be also written as a function of $S$ and $K$.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
I = \x.x
K = \x.\y.x
S = \x.\y.\z.(x z (y z))

S K K</script>
</div>
#+END_EXPORT

The interesting property of this particular set of combinators is that
every other lambda expression can be written in terms of them. We can
see how a particular lambda expression is written in SKI calculus by
turning on the *ski* mode of the interpreter.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
:ski on
S
false
true
or
and</script>
</div>
#+END_EXPORT

*Exercise 4.1:* How are Church-encoded numerals represented with SKI
combinators? Compute the first four or five numbers and try to come up
with the general rule.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
#+END_EXPORT

** Schönfinkel combinators
Schönfinkel and Church defined different but equivalent sets of
combinators. Some of the other classical combinators are

  * function application, `C`;
  * function composition, `B`;
  * and duplication of an argument, `W`;
  
and they are defined as

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
C = \f.\x.\y.f y x
B = \f.\g.\x.f (g x)
W = \x.\y.(y y)

# -- You can test the combinators here
:ski on
C S K S</script>
</div>
#+END_EXPORT

The [[https://en.wikipedia.org/wiki/Fixed-point_combinator#Fixed_point_combinators_in_lambda_calculus][Y combinator]] is related to recursion and we will discuss it on
future chapters.
* Data structures
