docs/tutorial.html
# -- Your solution goes here</script>
</div>
</div>
</div>

<div id="outline-container-orgb717667" class="outline-3">
<h3 id="orgb717667"><span class="section-number-3">3.2</span> Addition and multiplication</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The encoding of the addition and multiplication of natural numbers
will profit from the interpretation of numbers as functions. This is,
in fact, the only way we can use naturals; but we will quickly see
that this is an strenght instead of a weakness of our encoding. We are
really encoding naturals as their induction principle: we can define a
function by defining a zero and a successor.
</p>

<p>
The <code>double</code> function will only change the successor for the
composition of the successor function with itself.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
double = \n.\s.\z.n (compose s s) z
double 0
double 3
double 4</script>
</div>

<p>
<b>Exercise 3.2</b>: Define a <code>triple</code> function.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>

<p>
We are going now to define <b>addition</b> using this same principle. It
takes a successor and a zero, computes the first number as <code>(n s z)</code>
and then uses it as a zero on the interpretation of the second one.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
plus = \m.\n.\s.\z.m s (n s z)
plus 2 1
plus 3 4
plus 0 5</script>
</div>

<p>
<b>Exercise 3.3:</b> How would you define multiplication? Keep in mind that
you can use a number as a function. Keep also in mind the previous
exercises on <code>double</code> and <code>triple</code>.  <i>Spoilers below!</i>
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>

<p>
There many possible ways of defining multiplication. Some of them can
use the repeated application of <code>plus</code> to a number; but we are going
to define <b>multiplication</b> in a way that is similar to how we defined
<code>double</code> previously. We are going to interpret the successor as the
n-fold application of successor.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
mult = \m.\n.\s.\z.m (n s) z
mult 0 3
mult 1 5
mult 3 4</script>
</div>
</div>
</div>

<div id="outline-container-orge0d82a3" class="outline-3">
<h3 id="orge0d82a3"><span class="section-number-3">3.3</span> The predecessor function</h3>
<div class="outline-text-3" id="text-3-3">
<p>
But, how to compute the predecessor of a number? We have not encoded
negative numbers, so it could be a function returning zero whenever it
tries to get the predecessor of zero. It is an insightful exercise to
try to define it by yourself, but please, do not get too obsessed with
it. The solution is certainly not easy.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>

<p>
The solution is the term that follows this paragraph. You probably
expected something easier! Kleene, who was a student of Alonzo Church,
discovered for the first time how to write a predecessor on lambda
calculus while at the dentist. This discovery made Church start
thinking that every intuitively computable function could be computed
using lambda calculus, that is, that the notions of lambda-computable
function and intuitively computable function would coincide.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
pred = \n.\f.\x.n (\g.(\h.h (g f))) (\u.x) (\u.u)
pred 4
pred 1
pred 0</script>
</div>

<p>
But why does something like this even work? The main idea is to create
a function that can be applied to a pair of numbers \(n\) times and in
such a way that the first application renders \(1,0\), and any
subsequent application acts as a successor on both numbers. We finally
take only the second one. A detailed derivation of this function can
be found <a href="https://en.wikipedia.org/wiki/Church_encoding#Derivation_of_predecessor_function">here</a>.
</p>

<p>
<b>Exercise 3.4:</b> Use the predecessor function to define the <code>minus</code>
function. It should return the difference between two numbers. It
should return zero whenever the first number is smaller than the
second.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
</div>
</div>

<div id="outline-container-orgaa6a06b" class="outline-3">
<h3 id="orgaa6a06b"><span class="section-number-3">3.4</span> Predicates on natural numbers</h3>
<div class="outline-text-3" id="text-3-4">
<p>
This encoding even allow us to write predicates on natural
numbers. The first predicate will be a function distinguishing a
successor from a zero. It will be user later to build more complex
ones.
</p>

<p>
It is built by appliying a <code>const false</code> function <code>n</code> times to a true
constant. Only if it is applied <code>0</code> times, it will return a true
value.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
iszero = \n.(n (const false) true)
iszero 0
iszero 2
iszero 1</script>
</div>

<p>
Using this predicate, we can build <code>eq</code> and <code>leq</code>, corresponding to \(==\) and \(\leq\).
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
leq = \m.\n.(iszero (minus m n))
eq  = \m.\n.(and (leq m n) (leq n m))

leq 2 3
leq 4 1
eq  5 5</script>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfa8efb2" class="outline-2">
<h2 id="orgfa8efb2"><span class="section-number-2">4</span> Combinatory logic</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orge80361e" class="outline-3">
<h3 id="orge80361e"><span class="section-number-3">4.1</span> SKI combinators</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://en.wikipedia.org/wiki/Combinatory_logic">Combinatory logic</a> provides a notation for &lambda;-terms independent
from quantified variables. Every &lambda;-expression can be written in
terms of three combinators, \(S,K,I\), which are defined as
</p>

<ul class="org-ul">
<li>\(I = \lambda x.x\), the identity function.</li>
<li>\(K = \lambda x.\lambda y.x\), the constant function.</li>
<li>\(S = \lambda x.\lambda y.\lambda z. x z (y z)\), a generalized application.</li>
</ul>

<p>
The first one, the identity, can be also written as a function of \(S\) and \(K\).
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
I = \x.x
K = \x.\y.x
S = \x.\y.\z.(x z (y z))

S K K</script>
</div>

<p>
The interesting property of this particular set of combinators is that
every other lambda expression can be written in terms of them. We can
see how a particular lambda expression is written in SKI calculus by
turning on the <b>ski</b> mode of the interpreter.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
:ski on
S
false
true
or
and</script>
</div>

<p>
<b>Exercise 4.1:</b> How are Church-encoded numerals represented with SKI
combinators? Compute the first four or five numbers and try to come up
with the general rule.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here</script>
</div>
</div>
</div>

<div id="outline-container-org5974dee" class="outline-3">
<h3 id="org5974dee"><span class="section-number-3">4.2</span> Schönfinkel combinators</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Schönfinkel and Church defined different but equivalent sets of
combinators. Some of the other classical combinators are
</p>

<ul class="org-ul">
<li>function application, `C`;</li>
<li>function composition, `B`;</li>
<li>and duplication of an argument, `W`;</li>
</ul>

<p>
and they are defined as
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
C = \f.\x.\y.f y x
B = \f.\g.\x.f (g x)
W = \x.\y.(y y)

# -- You can test the combinators here
:ski on
C S K S</script>
</div>

<p>
The <a href="https://en.wikipedia.org/wiki/Fixed-point_combinator#Fixed_point_combinators_in_lambda_calculus">Y combinator</a> is related to recursion and we will discuss it on
future chapters.
</p>
</div>
</div>
</div>
