docs/tutorial.org
** Pairs
Pairs are easily defined from the boolean logic. The main idea will be
that, to apply a pair to a function will be the same thing that to
apply the function to its two components.

\[ \mathtt{pair}(a,b)(f) \equiv f\ a\ b \]

With this idea, pairs and their two projections are defined as
follows.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
tuple = \x.\y.\z.z x y
first = \p.p true
second = \p.p false

# Projections
first  (tuple 2 3)
second (tuple 2 3)

# Other functions
(tuple 3 4) plus
(tuple true false) or</script>
</div>
#+END_EXPORT

We use =true= and =false= to select the first or the second argument
to the function; it is possible to use the same idea to apply other
functions.
** Lists I: nil and cons
Data structures such as lists or binary trees can be represented using
the same principle we used to build naturals and booleans. We would
need two constructors to represent a list a =nil= signaling the end of
the list and a =cons=, joining an element to the head of the list. A
list would be something like this

\[ \mathtt{cons}\ 1\ (\mathtt{cons}\ 2\ (\mathtt{cons}\ 3\ \mathtt{nil})).\]

As we did with natural numbers, we are going to write a representation
independent from the constructors, they are going to be passed as
arguments. We need

  - =nil=, a list.
  - =cons=, a function taking an element (head) and a list (tail) and
    returning a new list.

This interpretation makes easier to write folding functions for
lists. We can define a function on a list simply giving the
interpretation for the =nil= and a binary function as an interpretation
for the =const=.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
# The interpretation of nil is the nil constructor
# The interpretation of (cons h t) is cons of h and the interpretation of t 
nil  = \c.\n.n
cons = \h.\t.\c.\n.(c h (t c n))</script>

# Example
cons 1 (cons 2 (cons 3 nil))

# Folds
(cons 1 (cons 2 (cons 3 nil))) plus 0
</div>
#+END_EXPORT

It is useful to encode this principle into a function called
=fold=. We are going to define a summation $\Sigma$ function and a
list product $\Pi$ function on lists.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
fold = \c.\n.\l.(l c n)
sum  = fold plus 0
prod = fold mult 1

# Examples
sum  (cons 1 (cons 3 (cons 4 nil)))
prod (cons 1 (cons 3 (cons 4 nil)))</script>
</div>
#+END_EXPORT

*Exercise 5.1:* Write the =any= and =all= functions. They are
functions that can be applied over lists of booleans.

  - =all= returns true if the list is made up only of /trues/.
  - =any= returns true if there is at least one /true/ on the list.

You may want to use the =fold= function.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here. Uncomment the following lines
# all = 
# any =

all (cons true  (cons true nil))
any (cons false (cons true nil))
</script>
</div>
#+END_EXPORT
** Lists II: map and filter
Map, filter and fold are the most famous examples of higher order
functions on lists and a common example of the power of functional
programming, which has its roots on lambda calculus.

  - The *map* function applies a function =f= to every element on a
    list.
  - The *filter* function removes the elements of the list that do not
    satisfy a given predicate. It "filters" the list, leaving only
    elements that satisfy the predicate.

We are going to implement these functions using our previously defined
=fold=.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Given a cons h t, we return a cons (f h) t; given a nil, we return a nil
map = \f.(fold (\h.\t.cons (f h) t) nil)

# Examples
sum               (cons 1 (cons 2 (cons 3 nil)))
sum (map succ     (cons 1 (cons 2 (cons 3 nil))))
sum (map (mult 0) (cons 1 (cons 2 (cons 3 nil))))</script>
</div>
#+END_EXPORT

*Exercise 5.3:* Write functions

  - doubling the value of each number on a list.
  - negating each value of a list of booleans.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here
# doublelist = 
# negate =</script>
</div>
#+END_EXPORT

*Filter* can be defined using a boolean to decide at each step whether
to return a list with a head or return the tail ignoring the head,
like this

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
filter = \p.(foldr (\h.\t.((p h) (cons h t) t)) nil)

# Example
length                (cons 2 (cons 3 (cons 5 nil)))
length (filter (eq 3) (cons 2 (cons 3 (cons 5 nil))))</script>
</div>
#+END_EXPORT

*Exercise 5.4:* Write a function that, given any list, returns a list
containing only the even numbers on the list.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here
# filterodd =</script>
</div>
#+END_EXPORT
** Binary trees
Lists have been defined using two constructors and trees will be
defined using the same technique. The only difference with lists is
that the =cons= constructor is going to be replaced by a =node=
constructor, which takes two trees as arguments. That is, a binary
tree is

  - an empty tree.
  - a node, containing a label, a left subtree, and a right subtree.

Defining functions using a fold-like combinator is again very simple
due to the chosen representation. We are going to need also a variant
of the usual function acting on three arguments, the label, the right
node and the left node.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
node = \x.\l.\r.\f.\n.(f x (l f n) (r f n))

# Example on natural numbers
mytree    = node 4 (node 2 nil nil) (node 3 nil nil)
triplesum = \a.\b.\c.plus (plus a b) c
mytree triplesum 0
</script>
</div>
#+END_EXPORT
* Recursion
