docs/tutorial.html
<div id="outline-container-org491a8ec" class="outline-2">
<h2 id="org491a8ec"><span class="section-number-2">5</span> Data structures</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgd66e0e1" class="outline-3">
<h3 id="orgd66e0e1"><span class="section-number-3">5.1</span> Pairs</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Pairs are easily defined from the boolean logic. The main idea will be
that, to apply a pair to a function will be the same thing that to
apply the function to its two components.
</p>

<p>
\[ \mathtt{pair}(a,b)(f) \equiv f\ a\ b \]
</p>

<p>
With this idea, pairs and their two projections are defined as
follows.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
tuple = \x.\y.\z.z x y
first = \p.p true
second = \p.p false

# Projections
first  (tuple 2 3)
second (tuple 2 3)

# Other functions
(tuple 3 4) plus
(tuple true false) or</script>
</div>

<p>
We use <code>true</code> and <code>false</code> to select the first or the second argument
to the function; it is possible to use the same idea to apply other
functions.
</p>
</div>
</div>
<div id="outline-container-orgf162806" class="outline-3">
<h3 id="orgf162806"><span class="section-number-3">5.2</span> Lists I: nil and cons</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Data structures such as lists or binary trees can be represented using
the same principle we used to build naturals and booleans. We would
need two constructors to represent a list a <code>nil</code> signaling the end of
the list and a <code>cons</code>, joining an element to the head of the list. A
list would be something like this
</p>

<p>
\[ \mathtt{cons}\ 1\ (\mathtt{cons}\ 2\ (\mathtt{cons}\ 3\ \mathtt{nil})).\]
</p>

<p>
As we did with natural numbers, we are going to write a representation
independent from the constructors, they are going to be passed as
arguments. We need
</p>

<ul class="org-ul">
<li><code>nil</code>, a list.</li>
<li><code>cons</code>, a function taking an element (head) and a list (tail) and
returning a new list.</li>
</ul>

<p>
This interpretation makes easier to write folding functions for
lists. We can define a function on a list simply giving the
interpretation for the <code>nil</code> and a binary function as an interpretation
for the <code>const</code>.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
# The interpretation of nil is the nil constructor
# The interpretation of (cons h t) is cons of h and the interpretation of t 
nil  = \c.\n.n
cons = \h.\t.\c.\n.(c h (t c n))</script>

# Example
cons 1 (cons 2 (cons 3 nil))

# Folds
(cons 1 (cons 2 (cons 3 nil))) plus 0
</div>

<p>
It is useful to encode this principle into a function called
<code>fold</code>. We are going to define a summation \(\Sigma\) function and a
list product \(\Pi\) function on lists.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
fold = \c.\n.\l.(l c n)
sum  = fold plus 0
prod = fold mult 1

# Examples
sum  (cons 1 (cons 3 (cons 4 nil)))
prod (cons 1 (cons 3 (cons 4 nil)))</script>
</div>

<p>
<b>Exercise 5.1:</b> Write the <code>any</code> and <code>all</code> functions. They are
functions that can be applied over lists of booleans.
</p>

<ul class="org-ul">
<li><code>all</code> returns true if the list is made up only of <i>trues</i>.</li>
<li><code>any</code> returns true if there is at least one <i>true</i> on the list.</li>
</ul>

<p>
You may want to use the <code>fold</code> function.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here. Uncomment the following lines
# all = 
# any =

all (cons true  (cons true nil))
any (cons false (cons true nil))
</script>
</div>
</div>
</div>
<div id="outline-container-org968c870" class="outline-3">
<h3 id="org968c870"><span class="section-number-3">5.3</span> Lists II: map and filter</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Map, filter and fold are the most famous examples of higher order
functions on lists and a common example of the power of functional
programming, which has its roots on lambda calculus.
</p>

<ul class="org-ul">
<li>The <b>map</b> function applies a function <code>f</code> to every element on a
list.</li>
<li>The <b>filter</b> function removes the elements of the list that do not
satisfy a given predicate. It "filters" the list, leaving only
elements that satisfy the predicate.</li>
</ul>

<p>
We are going to implement these functions using our previously defined
<code>fold</code>.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Given a cons h t, we return a cons (f h) t; given a nil, we return a nil
map = \f.(fold (\h.\t.cons (f h) t) nil)

# Examples
sum               (cons 1 (cons 2 (cons 3 nil)))
sum (map succ     (cons 1 (cons 2 (cons 3 nil))))
sum (map (mult 0) (cons 1 (cons 2 (cons 3 nil))))</script>
</div>

<p>
<b>Exercise 5.3:</b> Write functions
</p>

<ul class="org-ul">
<li>doubling the value of each number on a list.</li>
<li>negating each value of a list of booleans.</li>
</ul>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here
# doublelist = 
# negate =</script>
</div>

<p>
<b>Filter</b> can be defined using a boolean to decide at each step whether
to return a list with a head or return the tail ignoring the head,
like this
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
filter = \p.(foldr (\h.\t.((p h) (cons h t) t)) nil)

# Example
length                (cons 2 (cons 3 (cons 5 nil)))
length (filter (eq 3) (cons 2 (cons 3 (cons 5 nil))))</script>
</div>

<p>
<b>Exercise 5.4:</b> Write a function that, given any list, returns a list
containing only the even numbers on the list.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# -- Your solution goes here
# filterodd =</script>
</div>
</div>
</div>
<div id="outline-container-org5ff6639" class="outline-3">
<h3 id="org5ff6639"><span class="section-number-3">5.4</span> Binary trees</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Lists have been defined using two constructors and trees will be
defined using the same technique. The only difference with lists is
that the <code>cons</code> constructor is going to be replaced by a <code>node</code>
constructor, which takes two trees as arguments. That is, a binary
tree is
</p>

<ul class="org-ul">
<li>an empty tree.</li>
<li>a node, containing a label, a left subtree, and a right subtree.</li>
</ul>

<p>
Defining functions using a fold-like combinator is again very simple
due to the chosen representation. We are going to need also a variant
of the usual function acting on three arguments, the label, the right
node and the left node.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
node = \x.\l.\r.\f.\n.(f x (l f n) (r f n))

# Example on natural numbers
mytree    = node 4 (node 2 nil nil) (node 3 nil nil)
triplesum = \a.\b.\c.plus (plus a b) c
mytree triplesum 0
</script>
</div>
</div>
</div>
</div>
