docs/tutorial.org
** Fixpoints
We can use and define fixpoint operators in order to define recursive
functions. The problem they have is that they can not be evaluated
without arguments into a closed form, so we have to delay the
evaluation of the expression when we bind it. To do this, we use the
=!== operator, which binds an expression to a variable *without*
simplifying it.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Do not evaluate the fix combinator alone, it enters an infinite loop!
fix != (\f.(\x.f (x x)) (\x.f (x x)))
fix (const id)</script>
</div>
#+END_EXPORT

This `fix` operator (which is more commonly called the [[https://en.wikipedia.org/wiki/Fixed-point_combinator#Fixed_point_combinators_in_lambda_calculus][Y combinator]])
allows us to use the function we are defining on its own
definition. The function will be passed as the first argument to the
argument of fix, as =f = fix (\f. ...)=. It is important to notice
that recursive functions, even if they work, cannot be evaluated alone
without entering an infinite beta-reduction loop.

  * [[https://www.youtube.com/watch?v=9T8A89jgeTI][Essentials: Functional Programming's Y Combinator - Computerphile]]

In Mikrokosmos, we need the =!== operator when defining recursive
functions to prevent them from expanding.

Our first example is the *factorial* function.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
fact != fix (\f.\n.iszero n 1 (mult n (f (pred n))))
fact 3
fact 4</script>
</div>
#+END_EXPORT

The complexity of computing a factorial grows exponentially, and the
lambda calculus (and particularly, this encoding of natural numbers)
was not thought to be efficient. =fact 6= will surely be too much for
the interpreter.

As a last example, we are going to define *Fibonacci* numbers.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
fib != fix (\f.\n.iszero n 1 (plus (f (pred n)) (f (pred (pred n)))))

# Examples
fib 0
fib 1
fib 2
fib 3
fib 4

# Take care when defining functions using fixpoint combinators!
# Recursion can easily lead to non-terminating computations</script>
</div>
#+END_EXPORT
** Evaluation
The order in which evaluation is performed is crucial to determine if
an expression will eventually terminate. Mikrokosmos evaluates every
expression from left to right, that is, the arguments of a function
are not evaluated until they are being actually used on the
function. This is not the most efficient way: if the same argument
appears twice in the body of the function, it will be evaluated twice!
but it prevent some expressions taking from entering an inifinite
loop.

For example, =fix= is a non-terminating term (it *diverges*); but if
it is used inside an =ifelse= statement, it will be not evaluated at
all.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
false fix 3
true 4 fix</script>
</div>
#+END_EXPORT

If =false 2 fix= is evaluated, however, Mikrokosmos will enter an
infinite loop. Normally, your browser will allow you to stop the
Javascript script and reload the page.

* Types
** Simply typed \lambda-calculus
Until now, we have been talking about untyped lambda calculus, but we
are now going to deal with the simply-typed lambda calculus. The main
differences are that

  * every term has a type;
  * only a subset of the lambda expressions can be written in
    simply-typed lambda calculus, the typable ones;
  * every term normalizes, that is, every computation finishes;
  * as a consequence, it is not Turing-complete.
  
The command =:types on= activates types. Types are displayed with
every lambda expression, but certain lambda expressions which cannot
be typed cannot be used anymore. The =fix= operator is an example.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
:types on

# Some examples
id
K
fix

# Function application
plus
plus 3
plus 3 2</script>
</div>
#+END_EXPORT

A type is written as a set of type variables and arrows, where =A -> B=
represents the type of a function between =A= and =B=. Currying
works also with types, and a multiargument function must be written as
=A -> B -> C=. The interpreter will always try to infer the 
*most general type*, that is, it is preferible to have =A -> B= than the
particular case =A -> C -> D= where =B= happens to be =C -> D=.

** Propositions as types
What types are inhabited? It is easy to find an expression of the type
=A -> A=, but it seems that there is no expression of type =A -> B=. 
We can reason that any expression of that type should be able to
transform any given input type onto any desired output type, and that
such an expression would not be possible.

The rules of lambda calculus are similar to the rules of the
intuitionistic propositional logic; this means that a type will be
inhabited if and only if the type, reading arrows as logical
implications, is a tautology of propositional logic.

The axioms of intuistic propositional logic are

  * every expression implies itself, =A -> A=.
  * we can discard any assumption to arrive at a conclusion =A -> B -> A=.
  * an assumption can be used multiple times to arrive at intermediate
    conclusions, =(A -> B -> C) -> (A -> B) -> A -> C=.
  
Those are precisely the types of the SKI combinators. As any lambda
expression can be written in terms of these combinators, every lambda
expression of a type is actually a *proof* of the proposition the
type represents.

We can define some logical connectives using only the implication. For
example, the negation of a proposition $A$ would be a function taking
$A$ and returning any given type. As we discussed earlier, this should
be impossible, so the existence of a function `T -> B` where `B` is a
free variable should be a proof of the type `T` not being inhabited.

For example, we can write a proof of the *modus ponens* by presenting
an inhabitant of the type $A \to (A \to B) \to B$, where A and B are
free type variables.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Axioms of intuitionistic propositional logic
:types on
I
K
S

# Modus ponens
\a.\b.b a</script>
</div>
#+END_EXPORT
