docs/tutorial.html
<div id="outline-container-orgac3e947" class="outline-2">
<h2 id="orgac3e947"><span class="section-number-2">6</span> Recursion</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgb071650" class="outline-3">
<h3 id="orgb071650"><span class="section-number-3">6.1</span> Fixpoints</h3>
<div class="outline-text-3" id="text-6-1">
<p>
We can use and define fixpoint operators in order to define recursive
functions. The problem they have is that they can not be evaluated
without arguments into a closed form, so we have to delay the
evaluation of the expression when we bind it. To do this, we use the
<code>!=</code> operator, which binds an expression to a variable <b>without</b>
simplifying it.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Do not evaluate the fix combinator alone, it enters an infinite loop!
fix != (\f.(\x.f (x x)) (\x.f (x x)))
fix (const id)</script>
</div>

<p>
This `fix` operator (which is more commonly called the <a href="https://en.wikipedia.org/wiki/Fixed-point_combinator#Fixed_point_combinators_in_lambda_calculus">Y combinator</a>)
allows us to use the function we are defining on its own
definition. The function will be passed as the first argument to the
argument of fix, as <code>f = fix (\f. ...)</code>. It is important to notice
that recursive functions, even if they work, cannot be evaluated alone
without entering an infinite beta-reduction loop.
</p>

<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=9T8A89jgeTI">Essentials: Functional Programming's Y Combinator - Computerphile</a></li>
</ul>

<p>
In Mikrokosmos, we need the <code>!=</code> operator when defining recursive
functions to prevent them from expanding.
</p>

<p>
Our first example is the <b>factorial</b> function.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
fact != fix (\f.\n.iszero n 1 (mult n (f (pred n))))
fact 3
fact 4</script>
</div>

<p>
The complexity of computing a factorial grows exponentially, and the
lambda calculus (and particularly, this encoding of natural numbers)
was not thought to be efficient. <code>fact 6</code> will surely be too much for
the interpreter.
</p>

<p>
As a last example, we are going to define <b>Fibonacci</b> numbers.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Definition
fib != fix (\f.\n.iszero n 1 (plus (f (pred n)) (f (pred (pred n)))))

# Examples
fib 0
fib 1
fib 2
fib 3
fib 4

# Take care when defining functions using fixpoint combinators!
# Recursion can easily lead to non-terminating computations</script>
</div>
</div>
</div>
<div id="outline-container-orgfe49225" class="outline-3">
<h3 id="orgfe49225"><span class="section-number-3">6.2</span> Evaluation</h3>
<div class="outline-text-3" id="text-6-2">
<p>
The order in which evaluation is performed is crucial to determine if
an expression will eventually terminate. Mikrokosmos evaluates every
expression from left to right, that is, the arguments of a function
are not evaluated until they are being actually used on the
function. This is not the most efficient way: if the same argument
appears twice in the body of the function, it will be evaluated twice!
but it prevent some expressions taking from entering an inifinite
loop.
</p>

<p>
For example, <code>fix</code> is a non-terminating term (it <b>diverges</b>); but if
it is used inside an <code>ifelse</code> statement, it will be not evaluated at
all.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
false fix 3
true 4 fix</script>
</div>

<p>
If <code>false 2 fix</code> is evaluated, however, Mikrokosmos will enter an
infinite loop. Normally, your browser will allow you to stop the
Javascript script and reload the page.
</p>
</div>
</div>
</div>

<div id="outline-container-org9e0c1d1" class="outline-2">
<h2 id="org9e0c1d1"><span class="section-number-2">7</span> Types</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-org5d19b13" class="outline-3">
<h3 id="org5d19b13"><span class="section-number-3">7.1</span> Simply typed &lambda;-calculus</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Until now, we have been talking about untyped lambda calculus, but we
are now going to deal with the simply-typed lambda calculus. The main
differences are that
</p>

<ul class="org-ul">
<li>every term has a type;</li>
<li>only a subset of the lambda expressions can be written in
simply-typed lambda calculus, the typable ones;</li>
<li>every term normalizes, that is, every computation finishes;</li>
<li>as a consequence, it is not Turing-complete.</li>
</ul>

<p>
The command <code>:types on</code> activates types. Types are displayed with
every lambda expression, but certain lambda expressions which cannot
be typed cannot be used anymore. The <code>fix</code> operator is an example.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
:types on

# Some examples
id
K
fix

# Function application
plus
plus 3
plus 3 2</script>
</div>

<p>
A type is written as a set of type variables and arrows, where <code>A -&gt; B</code>
represents the type of a function between <code>A</code> and <code>B</code>. Currying
works also with types, and a multiargument function must be written as
<code>A -&gt; B -&gt; C</code>. The interpreter will always try to infer the 
<b>most general type</b>, that is, it is preferible to have <code>A -&gt; B</code> than the
particular case <code>A -&gt; C -&gt; D</code> where <code>B</code> happens to be <code>C -&gt; D</code>.
</p>
</div>
</div>

<div id="outline-container-orgbf73bb5" class="outline-3">
<h3 id="orgbf73bb5"><span class="section-number-3">7.2</span> Propositions as types</h3>
<div class="outline-text-3" id="text-7-2">
<p>
What types are inhabited? It is easy to find an expression of the type
<code>A -&gt; A</code>, but it seems that there is no expression of type <code>A -&gt; B</code>. 
We can reason that any expression of that type should be able to
transform any given input type onto any desired output type, and that
such an expression would not be possible.
</p>

<p>
The rules of lambda calculus are similar to the rules of the
intuitionistic propositional logic; this means that a type will be
inhabited if and only if the type, reading arrows as logical
implications, is a tautology of propositional logic.
</p>

<p>
The axioms of intuistic propositional logic are
</p>

<ul class="org-ul">
<li>every expression implies itself, <code>A -&gt; A</code>.</li>
<li>we can discard any assumption to arrive at a conclusion <code>A -&gt; B -&gt; A</code>.</li>
<li>an assumption can be used multiple times to arrive at intermediate
conclusions, <code>(A -&gt; B -&gt; C) -&gt; (A -&gt; B) -&gt; A -&gt; C</code>.</li>
</ul>

<p>
Those are precisely the types of the SKI combinators. As any lambda
expression can be written in terms of these combinators, every lambda
expression of a type is actually a <b>proof</b> of the proposition the
type represents.
</p>

<p>
We can define some logical connectives using only the implication. For
example, the negation of a proposition \(A\) would be a function taking
\(A\) and returning any given type. As we discussed earlier, this should
be impossible, so the existence of a function `T -&gt; B` where `B` is a
free variable should be a proof of the type `T` not being inhabited.
</p>

<p>
For example, we can write a proof of the <b>modus ponens</b> by presenting
an inhabitant of the type \(A \to (A \to B) \to B\), where A and B are
free type variables.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
# Axioms of intuitionistic propositional logic
:types on
I
K
S
