docs/tutorial.org
** Products, unions and logic
Mikrokosmos supports product, union, unit and void types. They
can be used with the following typed constructors

|-------------+-----------------------------------|
| Constructor | Type                              |
|-------------+-----------------------------------|
| =(-,-)=     | =A → B → A × B=                   |
| =fst=       | =(A × B) → A=                     |
| =snd=       | =(A × B) → B=                     |
| =inl=       | =A → A + B=                       |
| =inr=       | =B → A + B=                       |
| =unit=      | =⊤=                               |
| =abort=     | =⊥ → A=                           |
| =absurd=    | =⊥ → ⊥=                           |
| =caseof=    | =(A + B) → (A → C) → (B → C) → C= |
|-------------+-----------------------------------|

These types complete the correspondence between intuitionistic logic and lambda calculus. A type is inhabited if and only if its proposition is provable.

|---------------------+---------+-------------+---------------------|
| Description         | Type    | Proposition | Description         |
|---------------------+---------+-------------+---------------------|
| Product type        | =A × B= | =A ∧ B=     | Logical conjunction |
| Disjoint union type | =A + B= | =A ∨ B=     | Logical disjunction |
| Unit type           | =⊤=     | =⊤=         | True proposition    |
| Empty type          | =⊥=     | =⊥=         | False proposition   |
| Function to empty   | =A → ⊥= | =¬A=        | Logical negation    |
|---------------------+---------+-------------+---------------------|

The following are examples of the use of typed constructors.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
:types on
fst (2,3)
snd (2,3)
inl true
inr false
caseof (inl 3) (mult 2) (plus 1)
caseof (inr 3) (mult 2) (plus 1)
unit</script>
</div>
#+END_EXPORT

The characteristic difference of classical versus intuitionistic logic
is that $A \vee \neg A$ and $\neg \neg A \to A$ (the law of excluded
middle, LEM) are not provable on intuitionistic logic. It is not
possible to find an expression of type =A + (A → ⊥)=, 
which would correspond to $A \vee \neg A$.

It is possible, however, to prove $\neg \neg (A \vee \neg A)$.

#+BEGIN_EXPORT HTML
<div class="mikrojs-console">
<script type="text/mikrokosmos">
:types on
notnotlem = \f.f (inr (\a.absurd (f (inl a))))
notnotlem</script>
</div>
#+END_EXPORT
