docs/tutorial.html

# Modus ponens
\a.\b.b a</script>
</div>
</div>
</div>
<div id="outline-container-orgdd596df" class="outline-3">
<h3 id="orgdd596df"><span class="section-number-3">7.3</span> Products, unions and logic</h3>
<div class="outline-text-3" id="text-7-3">
<p>
Mikrokosmos supports product, union, unit and void types. They
can be used with the following typed constructors
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Constructor</th>
<th scope="col" class="org-left">Type</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>(-,-)</code></td>
<td class="org-left"><code>A → B → A × B</code></td>
</tr>

<tr>
<td class="org-left"><code>fst</code></td>
<td class="org-left"><code>(A × B) → A</code></td>
</tr>

<tr>
<td class="org-left"><code>snd</code></td>
<td class="org-left"><code>(A × B) → B</code></td>
</tr>

<tr>
<td class="org-left"><code>inl</code></td>
<td class="org-left"><code>A → A + B</code></td>
</tr>

<tr>
<td class="org-left"><code>inr</code></td>
<td class="org-left"><code>B → A + B</code></td>
</tr>

<tr>
<td class="org-left"><code>unit</code></td>
<td class="org-left"><code>⊤</code></td>
</tr>

<tr>
<td class="org-left"><code>abort</code></td>
<td class="org-left"><code>⊥ → A</code></td>
</tr>

<tr>
<td class="org-left"><code>absurd</code></td>
<td class="org-left"><code>⊥ → ⊥</code></td>
</tr>

<tr>
<td class="org-left"><code>caseof</code></td>
<td class="org-left"><code>(A + B) → (A → C) → (B → C) → C</code></td>
</tr>
</tbody>
</table>

<p>
These types complete the correspondence between intuitionistic logic and lambda calculus. A type is inhabited if and only if its proposition is provable.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Proposition</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Product type</td>
<td class="org-left"><code>A × B</code></td>
<td class="org-left"><code>A ∧ B</code></td>
<td class="org-left">Logical conjunction</td>
</tr>

<tr>
<td class="org-left">Disjoint union type</td>
<td class="org-left"><code>A + B</code></td>
<td class="org-left"><code>A ∨ B</code></td>
<td class="org-left">Logical disjunction</td>
</tr>

<tr>
<td class="org-left">Unit type</td>
<td class="org-left"><code>⊤</code></td>
<td class="org-left"><code>⊤</code></td>
<td class="org-left">True proposition</td>
</tr>

<tr>
<td class="org-left">Empty type</td>
<td class="org-left"><code>⊥</code></td>
<td class="org-left"><code>⊥</code></td>
<td class="org-left">False proposition</td>
</tr>

<tr>
<td class="org-left">Function to empty</td>
<td class="org-left"><code>A → ⊥</code></td>
<td class="org-left"><code>¬A</code></td>
<td class="org-left">Logical negation</td>
</tr>
</tbody>
</table>

<p>
The following are examples of the use of typed constructors.
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
:types on
fst (2,3)
snd (2,3)
inl true
inr false
caseof (inl 3) (mult 2) (plus 1)
caseof (inr 3) (mult 2) (plus 1)
unit</script>
</div>

<p>
The characteristic difference of classical versus intuitionistic logic
is that \(A \vee \neg A\) and \(\neg \neg A \to A\) (the law of excluded
middle, LEM) are not provable on intuitionistic logic. It is not
possible to find an expression of type <code>A + (A → ⊥)</code>, 
which would correspond to \(A \vee \neg A\).
</p>

<p>
It is possible, however, to prove \(\neg \neg (A \vee \neg A)\).
</p>

<div class="mikrojs-console">
<script type="text/mikrokosmos">
:types on
notnotlem = \f.f (inr (\a.absurd (f (inl a))))
notnotlem</script>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mario Román <a href="https://github.com/M42/">(github)</a></p>
<p class="date">Created: 2017-08-29 Tue 19:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
